tests/request.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Create xmlns="urn:microsoft-dynamics-schemas/page/wsvendor">
            <WSVendor>
                <Key>V123</Key>
                <No>V123</No>
                <Name>Suman Neupane</Name>
                <Address>Sanapa</Address>
                <Address_2>Building 42</Address_2>
                <Post_Code>12345</Post_Code>
                <City>Cityville</City>
                <County>Countyshire</County>
                <Country_Region_Code>US</Country_Region_Code>
                <Phone_No>123-456-7890</Phone_No>
                <Primary_Contact_No>987-654-3210</Primary_Contact_No>
                <Contact>Contact Person</Contact>
                <Search_Name>VendorSearch</Search_Name>
                <Balance_LCY>1000.00</Balance_LCY>
                <Post_Dated_Checks_LCY>500.00</Post_Dated_Checks_LCY>
                <_Balance_LCY_ABS_Post_Dated_Checks_LCY>500.00</_Balance_LCY_ABS_Post_Dated_Checks_LCY>
                <Purchaser_Code>P123</Purchaser_Code>
                <Responsibility_Center>RC001</Responsibility_Center>
                <Blocked>Payment</Blocked>
                <Bank_Account_Modified_By>User123</Bank_Account_Modified_By>
                <Last_Date_Modified>2023-01-01</Last_Date_Modified>
                <Weighbridge_Supplier_ID>1234000</Weighbridge_Supplier_ID>
                <Fax_No>555-1234</Fax_No>
                <E_Mail>vendor@example.com</E_Mail>
                <Home_Page>http://www.vendor.com</Home_Page>
                <IC_Partner_Code>ICP123</IC_Partner_Code>
                <Pay_to_Vendor_No>PAY456</Pay_to_Vendor_No>
                <Gen_Bus_Posting_Group>GBPG001</Gen_Bus_Posting_Group>
                <VAT_Bus_Posting_Group>VATPG123</VAT_Bus_Posting_Group>
                <WHT_Business_Posting_Group>WHTPG001</WHT_Business_Posting_Group>
                <Vendor_Posting_Group>VNPG001</Vendor_Posting_Group>
                <Invoice_Disc_Code>IDC001</Invoice_Disc_Code>
                <Prices_Including_VAT>true</Prices_Including_VAT>
                <Prepayment_Percent>10.00</Prepayment_Percent>
                <Application_Method>Manual</Application_Method>
                <Partner_Type>Person</Partner_Type>
                <Payment_Terms_Code>PTC001</Payment_Terms_Code>
                <Payment_Method_Code>PMC001</Payment_Method_Code>
                <Priority>1</Priority>
                <Cash_Flow_Payment_Terms_Code>CFTP001</Cash_Flow_Payment_Terms_Code>
                <Lodgement_Reference>LR123</Lodgement_Reference>
                <Our_Account_No>ACC001</Our_Account_No>
                <Block_Payment_Tolerance>true</Block_Payment_Tolerance>
                <EFT_Payment>true</EFT_Payment>
                <EFT_Bank_Account_No>EBAN001</EFT_Bank_Account_No>
                <Creditor_No>CRED123</Creditor_No>
                <Preferred_Bank_Account>PBAN001</Preferred_Bank_Account>
                <Location_Code>LOC001</Location_Code>
                <Shipment_Method_Code>SMC001</Shipment_Method_Code>
                <Lead_Time_Calculation>LTC001</Lead_Time_Calculation>
                <Base_Calendar_Code>BCC001</Base_Calendar_Code>
                <Customized_Calendar>CC001</Customized_Calendar>
                <Currency_Code>USD</Currency_Code>
                <Language_Code>EN</Language_Code>
                <VAT_Registration_No>VATREG001</VAT_Registration_No>
                <WHT_Registration_ID>WHTREG001</WHT_Registration_ID>
                <ID_No>ID123</ID_No>
                <IRD_No>IRD123</IRD_No>
                <ABN>ABN123</ABN>
                <ABN_Division_Part_No>ABN001</ABN_Division_Part_No>
                <Registered>true</Registered>
                <Foreign_Vend>false</Foreign_Vend>
                <Send_To_Concur>true</Send_To_Concur>
                <Concur_Invoice_Last_Updated>2023-01-01T12:00:00</Concur_Invoice_Last_Updated>
            </WSVendor>
        </Create>
    </Body>
</Envelope>
